import { Questions } from '@/types/questions.types';

const questions: Questions = [
  {
    title: 'Що для вас любов з першого погляду?',
    name: 'loveAtFirstSight',
    answers: [
      {
        title:
          'Булочка «Крафтяр» з вишнями і фісташковою крихтою з Власної кондитерської',
        image: '',
      },
      {
        title:
          'Поживний смузі «Крафтяр» з апельсиновим соком, манго та соком маракуї',
        image: '',
      },
    ],
  },
  {
    title: 'Як натякнути вам про свої почуття?',
    name: 'howToHintAboutFeelings',
    answers: [
      { title: 'Коробочкою карамельних та фруктових макаронів', image: '' },
      { title: 'Теплими варениками з картоплею із кулінарії', image: '' },
    ],
  },
  {
    title: 'Що перекусите перед побаченням?',
    name: 'whatToSnackBeforeDate',
    answers: [
      {
        title: 'Зроблю два бутерброди з хрустким часниковим багетом «Крафтяр»',
        image: '',
      },
      {
        title: 'Їсти не буду, випʼю комбучі й побіжу',
        image: '',
      },
    ],
  },
  {
    title: 'З яким десертом у вас абсолютний match?',
    name: 'favoriteDessert',
    answers: [
      {
        title: 'Повітряний та ніжний «Тирамісу» з маскарпоне',
        image: '',
      },
      {
        title: 'Десертний салат із соковитим манго',
        image: '',
      },
    ],
  },
  {
    title: 'Вас запросили на романтичну вечерю. Що приготувати?',
    name: 'dishForRomanticDinner',
    answers: [
      {
        title: 'Пасту з коктейльними томатами і королівськими печерицями',
        image: '',
      },
      {
        title: 'Апетитні пельмешки «Премія» зі сметанкою',
        image: '',
      },
    ],
  },
  {
    title: 'Яке побачення врятує настрій у сірий та дощовий день?',
    name: 'rainyDayDate',
    answers: [
      {
        title: 'Настільні ігри та солоні фісташки й рифлені чипси',
        image: '',
      },
      {
        title:
          'Романтична комедія та сметанковий сир і солоденький свіжий ананас',
        image: '',
      },
    ],
  },
  {
    title: 'пакет потрібен?',
    name: 'isBagNeeded',
    answers: [
      {
        title: 'Так, але наступного разу буду зі своїм',
        image: '',
      },
      {
        title: 'Ні, у мене завжди з собою є торбинка',
        image: '',
      },
    ],
  },
];

export default questions;
